using System.Text;

Console.OutputEncoding = Encoding.UTF8;

/* 
 * 1. Обчислення середнього заробітку: 
 * Напишіть програму, яка запитує користувача про зарплату кожного працівника за місяць. 
 * Після отримання всіх значень програма має обчислити та вивести середній заробіток.
 * 2. Побудова графіку зірочками: 
 * Напишіть програму, яка будує графік за допомогою зірочок. 
 * Користувач повинен ввести кількість рядків графіка. 
 * Кожен рядок графіка має містити відповідну кількість зірочок.
 * 3. Генерація простих чисел: 
 * Напишіть програму, яка генерує прості числа від 1 до заданого користувачем числа. 
 * Просте число - це число, яке ділиться лише на 1 і на себе.
 * 4. Перевірка паролю: 
 * Напишіть програму, яка перевіряє пароль користувача. 
 * Пароль вважається прийнятним, якщо він містить принаймні 8 символів, з яких принаймні один символ - це цифра, 
 * а також принаймні один символ - це спеціальний символ (наприклад, !, @, # тощо).
 * 5. Генерація фібоначчівської послідовності: 
 * Напишіть програму, яка генерує перші N чисел Фібоначчі. 
 * Послідовність Фібоначчі починається з 0 і 1, а кожне наступне число є сумою двох попередніх чисел у послідовності.
 * 6. Калькулятор оплати праці за годину: 
 * Напишіть програму, яка запитує в користувача кількість годин, працюваних за день, та розмір годинної ставки. 
 * Після введення значень програма має обчислити та вивести оплату за день.
 * 7. Генерація таблиці множення для конкретного числа: 
 * Напишіть програму, яка запитує в користувача число, а потім генерує таблицю множення для цього числа від 1 до 10.
 * 8. Перевірка на простоту: 
 * Напишіть програму, яка перевіряє, чи є задане користувачем число простим. 
 * Число вважається простим, якщо воно ділиться лише на 1 і на себе.
 */

Console.WriteLine("8. Перевірка на простоту.\nВедіть будь-яке ціле число: ");
string number_8 = Console.ReadLine();
int integer_8 = Convert.ToInt32(number_8);
for (int i = 2; i < integer_8; i++)
{
    if (integer_8 % i == 0)
    {
        Console.WriteLine("НЕ просте");
        break;
    }
}
Console.WriteLine("Просте число");
