// 1.Створити масив із 10 елементів типу int. Присвоїти їм випадкові значення від -10 до 10,
// використовуючи клас Random (https://learn.microsoft.com/en-us/dotnet/api/system.random?view=net-8.0)
// Вивести на екран елементи масиву з парним індексом. (не парні значення, а саме парні індекси!!)

// 2.Визначити, чи вірно, що сума елементів масиву з пункту 1 є невід'ємне число.

// 3. Створити та заповнити двовимірний масив розміру 9х9 з результатами таблиці множення
// (у першому рядку мають бути записані добутки кожного з чисел від 1 до 9 на 1, у другому – на 2, ..., в останньому – на 9).
// Тобто в 1 строчці будуть значення від 1 до 9, а у другому 2,4,6,....,18 і т.д.

// 4. Створити двовимірний масив 5х5. Заповнити його будь-якими числами.
// Визначити та вивести на екран: а) максимальний елемент масиву; б) мінімальний елемент масиву;
// в) координати мінімального елемента масиву. г) координати максимального елемента масиву.

// 5. За допомогою enum створити програму, що буде запитувати у користувача кількість днів,
// а потім рахувати який буде день через введену кількість, якщо рахувати від понеділка і виводити результат. Наприклад: 
// Приклад 1: Вхідний параметр: 13 Очікуваний вивід: Sunday
// Приклад 2: Вхідний параметр: 3 Очікуваний вивід: Thursday